# Ultralytics YOLO 🚀, AGPL-3.0 License
# YOLO11n_cbam_fixed.yaml

# Parameters
nc: 6 # number of classes
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

#YAML:施工图纸
#第一列：-1代表“接上一层”：拿上一层输出做这一层输入；[-1,6]代表把上一层和第六层结果叠在一起做这一层输入
#第二列：重复次数，这个决定了n/s/m/l版本的不同
#第三列：类名：这一层用的什么模块。
#第四列：传给__init__()函数的参数，对于Conv[out_channels,kernel_size,stride]
#      out_channels:输出通道数。（决定这一层提取多少种特征，即厚度）
#      kernel_size:卷积核大小。3代表3*3卷积核
#      stride：步长。1代表图片长宽不变。2代表长宽减半，即下采样
#  图片缩小像素点=细节丢失，但视野变大


# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  #步长2，图片缩小到320*320，特征变厚为64(64通道）
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  #图片到160*160，厚度128
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  #图片到80*80，厚度256
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  #图片到40*40，厚度512
  - [-1, 2, C3k2, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  #图片到20*20，厚度1024
  - [-1, 2, C3k2, [1024, True]] # 8

  - [-1, 1, SPPF, [1024, 5]] # 9
  #图片到这里只有20*20，特征极其厚1024
  - [-1, 2, C2PSA, [1024]]   # 10

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  #upsample上采样，图片从20*20放大2倍到40*40
  - [[-1, 6], 1, Concat, [1]] #12 cat backbone P4
  #拿上层40*40结果和backbone的第六层40*40结果叠在一起
  - [-1, 2, C3k2, [512, False]] # 13)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, Concat, [1]] # 15. cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 16 (P3/8-small)

  # 👇 尝试 1: 在 P3 分支（处理小目标）输出前加 EMA
  - [-1, 1, EMA, [256]] # 17. 这里的特征图大，细节多，EMA 最喜欢！

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 20 (P4/16-medium)

  # 👇 尝试 2: (可选) 在 P4 分支也加一个
  #- [-1, 1, EMA, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 23 (P5/32-large)

  - [[17, 20, 23], 1, Detect, [nc]] # Detect(P3, P4, P5)
  #p3小目标，接在17层的ema处理完后的结果；p4中目标接在20层的c3k2；p5大目标接在23层的c3k2
  # ⚠️注意：如果加了层，Detect 里的索引(17,20,23)也要相应+1